<a href="https://colab.research.google.com/github/young950814/SPLIT-/blob/master/DSH_3(5).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import numpy as np

In [0]:
index = [('California',2000), ('California', 2010),
        ('New York', 2000), ('New York', 2010),
        ('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
              18976457, 19378102,
              20851820, 25145561]
pop = pd.Series(populations, index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [0]:
pop[('California', 2010):('Texas', 2000)]

(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
dtype: int64

In [0]:
pop[[i for i in pop.index if i[1] ==2010]] #이건 복잡하다.

(California, 2010)    37253956
(New York, 2010)      19378102
(Texas, 2010)         25145561
dtype: int64

In [0]:
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex(levels=[['California', 'New York', 'Texas'], [2000, 2010]],
           labels=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]])

In [0]:
pop = pop.reindex(index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [0]:
pop[:, 2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

In [0]:
pop_df = pop.unstack()
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [0]:
pop_df.stack()

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [0]:
pop_df = pd.DataFrame({'total' : pop,
                      'under18' : [9267089, 9284094,
                                  4687374, 4318033,
                                  5906301, 6879014]})
pop_df

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [0]:
f_u18 = pop_df['under18'] / pop_df['total']
f_u18.unstack()

                2000      2010
California  0.273594  0.249211
New York    0.247010  0.222831
Texas       0.283251  0.273568

In [0]:
df = pd.DataFrame(np.random.rand(4,2),
                 index=[['a','a','b','b'], [1,2,1,2]],
                 columns=['data1','data2']) #constructing a multiindex dataframe

df

        data1     data2
a 1  0.137523  0.221182
  2  0.365458  0.541121
b 1  0.595187  0.246916
  2  0.376867  0.404248

In [0]:
data={('California', 2000): 33871648,
     ('California', 2010): 37253956,
     ('Texas', 2000): 20851820,
     ('Texas', 2010): 25145561,
     ('New York', 2000): 18976457,
     ('New York', 2010): 19378102}

pd.Series(data) #automatically recognizes as multiindex

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [0]:
pd.MultiIndex.from_arrays([['a','a','b','b'], [1,2,1,2]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [0]:
pd.MultiIndex.from_product([['a','b'],[1,2]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [0]:
pd.MultiIndex(levels=[['a','b'],[1,2]],
             labels=[[0,0,1,1],[0,1,0,1]])

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [0]:
pop.index.names = ['state','year']
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [0]:
# hierarchical indices and columns
index = pd.MultiIndex.from_product([[2013,2014],[1,2]],
                                   names=['year','visit'])
columns = pd.MultiIndex.from_product([['Bob','Guido','Sue'],['HR','Temp']],
                                    names=['subject','type'])

# mock some data
data = np.round(np.random.randn(4,6), 1)
data[:, ::2] *= 10
data += 37

# create the DataFrame
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      40.0  35.9  18.0  37.6  46.0  36.6
     2      16.0  37.0  36.0  36.3  33.0  37.8
2014 1      45.0  36.6  27.0  38.1  44.0  37.2
     2      34.0  36.3  37.0  37.4  44.0  35.6

In [0]:
health_data['Guido']

type          HR  Temp
year visit
2013 1      18.0  37.6
     2      36.0  36.3
2014 1      27.0  38.1
     2      37.0  37.4

In [0]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [0]:
pop['California', 2000]

33871648

In [0]:
pop['California']

year
2000    33871648
2010    37253956
dtype: int64

In [0]:
pop.loc['California':'New York']

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
dtype: int64

In [0]:
pop[:, 2000]

state
California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [0]:
pop[pop > 22000000]

state       year
California  2000    33871648
            2010    37253956
Texas       2010    25145561
dtype: int64

In [0]:
pop[['California','Texas']]

state       year
California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
dtype: int64

In [0]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      40.0  35.9  18.0  37.6  46.0  36.6
     2      16.0  37.0  36.0  36.3  33.0  37.8
2014 1      45.0  36.6  27.0  38.1  44.0  37.2
     2      34.0  36.3  37.0  37.4  44.0  35.6

In [0]:
health_data['Guido', 'HR']

year  visit
2013  1        18.0
      2        36.0
2014  1        27.0
      2        37.0
Name: (Guido, HR), dtype: float64

In [0]:
health_data.iloc[:2, :2]

subject      Bob
type          HR  Temp
year visit
2013 1      40.0  35.9
     2      16.0  37.0

In [0]:
health_data.loc[:, ('Bob', 'HR')]

year  visit
2013  1        40.0
      2        16.0
2014  1        45.0
      2        34.0
Name: (Bob, HR), dtype: float64

In [0]:
health_data.loc[(:, 1), (:, 'HR')]

SyntaxError: ignored

In [0]:
idx = pd.IndexSlice
health_data.loc[idx[:, 1], idx[:, 'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      40.0  18.0  46.0
2014 1      45.0  27.0  44.0

In [0]:
index = pd.MultiIndex.from_product([['a','c','b'],[1,2]])
data = pd.Series(np.random.rand(6), index=index)
data.index.names = ['char', 'int']
data

char  int
a     1      0.521008
      2      0.960113
c     1      0.824439
      2      0.843410
b     1      0.367390
      2      0.728777
dtype: float64

In [0]:
try:
  data['a':'b']
except KeyError as e:
  print(type(e))
  print(e) #class 'KeyError'가 아니라 UnsortedIndexError가 뜸.

<class 'pandas.errors.UnsortedIndexError'>
'Key length (1) was greater than MultiIndex lexsort depth (0)'

In [0]:
data = data.sort_index()
data

char  int
a     1      0.521008
      2      0.960113
b     1      0.367390
      2      0.728777
c     1      0.824439
      2      0.843410
dtype: float64

In [0]:
data['a':'b']

char  int
a     1      0.521008
      2      0.960113
b     1      0.367390
      2      0.728777
dtype: float64

In [0]:
pop.unstack(level=0)

state  California  New York     Texas
year
2000     33871648  18976457  20851820
2010     37253956  19378102  25145561

In [0]:
pop.unstack(level=1)

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [0]:
pop.unstack().stack()

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [0]:
pop_flat = pop.reset_index(name='population')
pop_flat

        state  year  population
0  California  2000    33871648
1  California  2010    37253956
2    New York  2000    18976457
3    New York  2010    19378102
4       Texas  2000    20851820
5       Texas  2010    25145561

In [0]:
pop_flat.set_index(['state','year'])

                 population
state      year
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561

In [0]:
data_mean = health_data.mean(level='year')
data_mean

subject   Bob        Guido          Sue
type       HR   Temp    HR   Temp    HR  Temp
year
2013     28.0  36.45  27.0  36.95  39.5  37.2
2014     39.5  36.45  32.0  37.75  44.0  36.4

In [0]:
data_mean.mean(axis=1, level='type')

type    HR       Temp
year
2013  31.5  36.866667
2014  38.5  36.866667